use MovieDB;

CREATE TABLE schedule (
    id INT PRIMARY KEY AUTO_INCREMENT,
    title VARCHAR(100) NOT NULL,
    screen VARCHAR(10) NOT NULL,
    time VARCHAR(10) NOT NULL,
    runtime INT NOT NULL,
    date DATE NOT NULL
);

INSERT INTO schedule (title, screen, time, runtime, date) VALUES
('어벤져스:엔드게임', '1관', '14:00', 240, '2025-06-18'),
('어벤져스:엔드게임', '1관', '19:00', 240, '2025-06-18'),
('어벤져스:엔드게임', '2관', '16:00', 240, '2025-06-18'),
('어벤져스:엔드게임', '3관', '22:00', 240, '2025-06-18'),
('어벤져스:엔드게임', '3관', '23:30', 240, '2025-06-18'),
('뽀로로 극장판 슈퍼스타 대모험', '4관', '23:30', 120, '2025-06-18'),
('뽀로로 극장판 슈퍼스타 대모험', '5관', '12:00', 120, '2025-06-19'),
('뽀로로 극장판 슈퍼스타 대모험', '6관', '16:00', 120, '2025-06-19'),
('드래곤 길들이기', '7관', '12:30', 125, '2025-06-18'),
('드래곤 길들이기', '8관', '23:50', 125, '2025-06-18'),
('드래곤 길들이기', '7관', '23:30', 125, '2025-06-18');

INSERT INTO schedule (title, screen, time, runtime, date) VALUES
('어벤져스:엔드게임', '1관', '14:00', 240, '2025-06-19'),
('어벤져스:엔드게임', '1관', '19:00', 240, '2025-06-19'),
('어벤져스:엔드게임', '2관', '16:00', 240, '2025-06-19'),
('어벤져스:엔드게임', '3관', '22:00', 240, '2025-06-19'),
('어벤져스:엔드게임', '3관', '23:30', 240, '2025-06-19');


